Repository: CarDGee/installer
Catalog: po/*/LC_MESSAGES/installer.po
Languages: es

source: Welcome to generate command ================================================================================ I'll prepare a stageX tarball, after extracting a regular stage3 tarball during installation, you can extract stageX tarball and you'll have most of the files needed to finish installation, some of these files include: /etc/portage/* : All the required files and subdirectories. /var/lib/portage/world : List of currently installed programs. /etc/timezone : Current timezone /etc/locale.gen : Current locales Once you extract stageX tarball you'll still need to: Update your repository (emerge-webrsync) Update @world Configure timezone and locales Update your /etc/fstab file Configure your kenrel. Configure your bootloader.
es: Bienvenido al comando generate ================================================================================ Voy a preparar un comprimido stageX, tras extraer un comprimido stage3 durante una instalación, puedes extraer el stageX y tendrás la mayoría de los archivos necesarios para terminar la instalación, algunos de estos archivos incluyen: /etc/portage/* : Todos los archivos y subdirectorios. /var/lib/portage/world : Lista de programas instalados actualmente. /etc/timezone : Timezone actual /etc/locale.gen : Locales actuales Una vez extraído el stageX todavía necesitarás realizar lo siguiente: Actualizar tu repositorio (emerge-webrsync) Actualizar @world Configurar tu timezone y locales Actualizar tu archivo /etc/fstab Configurar tu kenrel. Configurar tu bootloader.

source: Installer is designed to aid users to install Gentoo Linux.
es: Installer está diseñado para ayudar a los usuarios a instalar Gentoo Linux.

source: Welcome to installer TUI.
es: Bienvenido al TUI de installer.

source: Use the arrow to select the step and press ENTER
es: Usa las flecha para seleccionar un paso y presiona ENTER

source: Step 1: Welcome to Gentoo installer!
es: Paso 1: ¡Bienvenido al instalador de Gentoo!

source: Step 2: Preparing the disks
es: Paso 2: Preparando los discos

source: Step 3: Installing Stage3
es: Paso 3: Instalando Stage3

source: Step 4: Configuring compile options
es: Paso 4: Configurando las opciones de compilación

source: Step 5: Installing the Gentoo base system
es: Paso 5: Instalando el sistema base Gentoo

source: Step 6: Entering the chroot
es: Paso 6: Entrando en el chroot

source: Step 7: Configuring Portage
es: Paso 7: Configurando Portage

source: Step 8: Configuring the system
es: Paso 8: Configurando el sistema

source: Step 9: Configuring the kernel
es: Paso 9: Configurando el kernel

source: Step 10: Configuring the system
es: Paso 10: Configurando el sistema

source: Step 11: Configuring the bootloader
es: Paso 11: Configurando el bootloader

source: You need to provide an action, see installer --help or -h for more info
es: Necesitas proveer una acción, mira installer --help o -h para más información

source: You need to be root for using installer
es: Necesitas ser root para usar installer

source: If you find this useful or find a bug please contact to: {}
es: Si lo has encontrado útil o algún bug, por favor contacta a: {}

source: available subcommands
es: sub-comandos disponibles

source: Installer implements two ways of installing Gentoo Linux, from scratch and from an existing system.
es: Installer implementa dos maneras de installar Gentoo Linux, desde cero o desde un sistema existente.

source: for specific info use installer <command> --help
es: para información específica usa installer <comando> --help

source: <command>
es: <comando>

source: begin a new Gentoo Linux installation
es: comienza una nueva instalación de Gentoo Linux

source: begin on a specific step of installation
es: comienza en un paso específico de la instalación

source: launch Terminal User Interface
es: lanza la interfaz por consola (TUI)

source: generate a stageX tarball from current system
es: genera un comprimido stageX del sistema actual

source: include /usr/src/ directory in stageX
es: incluye el directorio /usr/src/ en stageX

source: clean installer from /mnt/gentoo
es: eliminar installer de /mnt/gentoo

source: Opening new shell inside installer, use 'exit' to close and show next message:
es: Abriendo nuevo shell, usa 'exit' para cerrar y mostrar el siguiente mensaje:

source: Chrooting into the new Gentoo system, run `installer beginner -s 7`
es: Entrando al chroot del nuevo sistema, ejecuta `installer beginner -s 7`

source: Something went wrong with the terminal, please verify it.
es: Algo salió mal con el terminal, por favor verifícalo.

source: Error: /mnt/gentoo not mounted, please verify.
es: Error: /mnt/gentoo no está montado, por favor verifica.

source: Thank you for trying installer
es: Gracias por probar installer

source: Welcome to Gentoo installer! ================================================================================ Before begin we need to make sure that you reach www.gentoo.org to be able to download stage3 tarball. You can check with: ping -c 2 www.gentoo.org For more detailed information refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Networking
es: ¡Bienvenido a installer! ================================================================================ Antes de comenzar necesitamos asegurar que hay conexión con www.gentoo.org para poder descargar el comprimido stage3. Puedes revisar con: ping -c 2 www.gentoo.org Para más detalles referir a: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Networking

source: Verifying connectivity with www.gentoo.org...
es: Verificando conectividad con www.gentoo.org...

source: We have connection!Now you can proceed to step 2
es: ¡Tenemos conexión! Ahora puedes proceder al paso 2

source: This prototype was not capable to resolve the issue, please refer to Gentoo Handbook, section 'Configuring the network', for more info.
es: Este prototipo no es capaz de resolver el problema, por favor mira el manual de Instalación de Gentoo, sección 'Configurando la red', para mayor información.

source: Step 2 - Preparing the disks ================================================================================ Now we are going to prepare your block device and make a partition table to be able to store your filesystems, you have two options: MBR (Master Boot Record), you'll need to use fdisk. GPT (GUID Partition Table), you'll need to use parted. Althought this prototype is not designed to generate a partition table, you may find interesting the next suggestion: - You must have a root (/) partition. - You'll probably like a /boot partition. - You may want a swap partition. - You may want a separate /home partition. For more detailed info, please refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks
es: Paso 2 - Preparando los discos ================================================================================ Ahora vamos a preparar los discos y hacer una tabla de particiones para poder guardar tu filesystem, tienes dos opciones: MBR (Master Boot Record), necesitarás usar fdisk. GPT (GUID Partition Table), necesitarás usar parted. Aunque este prototipo no está diseñado para generar una tabla de particiones, tal vez encuentres interesante la siguiente sugerencia: - Tienes que tener una partición raíz (/). - Probablemente quieras una partición /boot. - Tal vez quieras una partición swap. - Tal vez quieras una partición /home separada. Para información más detallada, revisa el siguiente link: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks/es

source: Now that you have a partition table, you need to create a filesystem on each partition to be able to store data. This prototype assumes that you'll create ext4 filesystems, some useful commands include: mkfs.ext4 /dev/sdXy where: -X is the device letter -y is the partition number To be able to create a swap partition, you can use: mkswap /dev/sdXy swapon /dev/sdXy For more detailed info please refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks#Creating_file_systems
es: Ahora que tienes una tabla de particiones, necesitas crear un filesystem en cada partición para poder almacenar data. Este prototipo asume que vas a crear filesystems de tipo ext4, algunos comandos útils incluyen: mkfs.ext4 /dev/sdXy donde: -X es la letra de la dispositivo de bloque -y es el número de partición Para poder crear una partición swap, puedes usar: mkswap /dev/sdXy swapon /dev/sdXy Para más información revisa: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks#Creating_file_systems

source: Finally, we need you to mount your root partition (/) into /mnt/gentoo. If you don't have a /mnt/gentoo directory, you can create one with: mkdir -p /mnt/gentoo Then you need to mount it with: mount /dev/sdXy /mnt/gentoo
es: Finalmente, necesitamos montar tu partición raíz (/) en /mnt/gentoo. Si no tienes un directorio /mnt/gentoo , puedes crear uno con: mkdir -p /mnt/gentoo Después lo puedes montar con: mount /dev/sdXy /mnt/gentoo

source: Great, we'll continue with step 3 in a few seconds!
es: ¡Genial, ahora vamos a continuar con el paso 3 en unos segundos!

source: Step 3 - Installing Stage3 ================================================================================ Before to be able to download a stage3 tarball, you need to check wheter your date and time is correct, not doing so could produce unexpected results or it may be impossible to download it from a trusted mirror. You can use `date` command to verify. Official Gentoo Installation media includes `ntpd` command, which may help you in the syncronization. Using ntpd requires that you send your IP adrress to the time server, if that's a problem you can set it manually with the `date` command itself. For more detailed info, please refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Stage
es: Paso 3 - Instalando Stage3 ================================================================================ Antes de poder descargar un comprimido stage3, necesitas revisar si la fecha y hora son correctas, no hacerlo producirá resultados inesperados o incluso hacer imposible la descarga desde un mirror de confianza. Puedes usar el comando `date` para verificar. El medio oficial de instalación incluye el comando `ntpd`, que puede ayudar a sincronizar. Usar ntpd requiere que envíes tu IP al servidor de tiempo, si eso es un problema puedes configurar de manera manual usando el comando `date`. Para más información por favor revisa: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Stage

source: Now you need the download a stage3 tarball. Stage3 contains all the required data to be able to build your system. Check the next URL for a mirror list: https://www.gentoo.org/downloads/mirrors/ Once you find the perfect mirror, you need to download a stage3 for your specific architecture. Usually you'll find a URL like: protocol://mirror/releases/amd64/autobuilds/stage3_dir/stage3*.{bz2|xz} Move to /mnt/gentoo and use one of the following commands: wget <URL> links <URL> and choose the tarball in the cli-browser Remember to download .DIGEST or .DIGEST.asc if you want to verify and validate the stage3 tarball. More information about validation and verification please refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Stage#Verifying_and_validating
es: Ahora necesitas descargar el comprimido stage3. Stage3 contiene toda la data requerida para poder construir un sistema. Revisa la lista de mirror en el link: https://www.gentoo.org/downloads/mirrors/ Una vez encontrado un mirror, puedes descargar stage3 para tu arquitectura específica. Usualmente un URL como: protocol://mirror/releases/amd64/autobuilds/stage3_dir/stage3*.{bz2|xz} Muevete a /mnt/gentoo y usa uno de los siguietnes comandos: wget <URL> links <URL> y escoge el comprimido en el navegador por consola Recuerda descargar el .DIGEST o .DIGEST.asc si quieres verificar y validar el comprimido stage3. Para más información sobre verificación y validación, visita: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Stage#Verifying_and_validating

source: Now that stage3 is located in /mnt/gentoo you can unpack the contents. Please use the exact command: tar xpf stage3-*.tar.xz --xattrs-include='*.*' --numeric-owner Explanation: x: stands for extract p: stands for preserve permissions f: stands for file --xattrs-include='*.*': preserves extended attributes --numeric-owner: keep UID and GID from tarball
es: Ahora que stage3 está ubicado en /mnt/gentoo puedes extraer el contenido. Por favor usa el siguiente comando: tar xpf stage3-*.tar.xz --xattrs-include='*.*' --numeric-owner Explicación: x: para extraer p: para preservar los permisos f: para seleccionar un archivo --xattrs-include='*.*': preserva atributos extendidos --numeric-owner: mantiene UID y GID del comprimido

source: Step 4 - Configuring compile options ================================================================================ Now we need to prepare Portage for the first update. All the env variables used by Portage are written in /mnt/gentoo/etc/portage/make.conf,for a more detailed list of all possible variables, refer to: /mnt/gentoo/usr/share/portage/config/make.conf.example Since we are going to prepare the first update, we only need to set these variables:(you can use `nano` or another text editor) CFLAGS="-march=native -O2 -pipe" Explanation: -march=native: tells the compiler to select the target architecture of the current system. -O2:(capital O letter) gcc optimization class flag, recommended. MAKEOPTS="-jX" Where: X: number of CPUs (CPU cores) plus one. Example: -j2
es: Paso 4 - Configurando opciones de compilación ================================================================================ Ahora necesitamos preparar Portage para la primer actualización. Todas las variables usadaspor Portage están escritas en /mnt/gentoo/etc/portage/make.conf, para información más detallada de la lista de variables posibles, revisa: /mnt/gentoo/usr/share/portage/config/make.conf.example Dado que vamos a preparar la primer actualización, solo necesitas configurar estas variables:(puedes usar `nano` u otro editor de texto) CFLAGS="-march=native -O2 -pipe" Explanation: -march=native: le dice al compilador que seleccione la arquitectura del sistema actual. -O2:(letra O mayúscula) opción de optimización de gcc, recomendada. MAKEOPTS="-jX" Donde: X: número de CPUs (núcleos de CPU) más uno. Ejemplo: -j2

source: Great! Now we can start Step 5
es: ¡Genial! Ahora empecemos el paso 5

source: Please review your make.conf file, something is wrong, you can resume with 'installer beginner -s 4' once you fixed it.
es: Por favor revisa tu archivo make.conf, algo está mal, puedes resumir con 'installer beginner -s 4' cuando esté arreglado.

source: Step 5 - Installing the Gentoo base system ================================================================================ If you are using a Official Gentoo Installation media, you may want to select a mirror to be able to download the source code faster, use the next command: mirrorselect -i -o >> /mnt/gentoo/etc/portage/make.conf After that, you need to create a directory for your ebuild repository, execute: mkdir --parents /mnt/gentoo/etc/portage/repos.conf And then copy the Gentoo repository configuration file provided by Portage in the newly created repos.conf directory: cp /mnt/gentoo/usr/share/portage/config/repos.conf \ /mnt/gentoo/etc/portage/repos.conf/gentoo.conf Finally, copy the DNS info before entering the new environment: cp --dereference /etc/resolv.conf /mnt/gentoo/etc
es: Paso 5 - Instalando el sistema base de Gentoo ================================================================================ Si estás usando un medio oficial de instalación, tal vez quieras elegir un mirror para poder descargar el código fuente más rápido, usa este comando: mirrorselect -i -o >> /mnt/gentoo/etc/portage/make.conf Después, necesitas crear un directorio para tu repositorio de ebuilds, ejecuta: mkdir --parents /mnt/gentoo/etc/portage/repos.conf Y luego copia la configuración de repositorio por defecto provista por Portage en el recién creado directorio repos.conf: cp /mnt/gentoo/usr/share/portage/config/repos.conf \ /mnt/gentoo/etc/portage/repos.conf/gentoo.conf Finalmente, copia la información DNS antes de entrar en el nuevo ambiente: cp --dereference /etc/resolv.conf /mnt/gentoo/etc

source: Before to enter the brand new Gentoo system, you need to mount certain filesystems to be capable to change the Linux root. Use the following commands: mount --types proc /proc /mnt/gentoo/proc mount --rbind /sys /mnt/gentoo/sys mount --make-rslave /mnt/gentoo/sys mount --rbind /dev /mnt/gentoo/dev mount --make-rslave /mnt/gentoo/dev Note: --make-rslave is needed for systemd support later in installation. I'll install myself inside the chroot so you'll be able to continue the tutorial directly.
es: Antes de entrar en el nuevo sistema Gentoo, necesitas montar ciertos filesystems para poder cambiar el root de Linux. Usa los siguientes comandos: mount --types proc /proc /mnt/gentoo/proc mount --rbind /sys /mnt/gentoo/sys mount --make-rslave /mnt/gentoo/sys mount --rbind /dev /mnt/gentoo/dev mount --make-rslave /mnt/gentoo/dev Nota: --make-rslave es necesario para soportar systemd luego en la instalación. Me voy a instalar dentro del chroot para que puedas continuar el tutorial desde el interior del chroot.

source: Downloading and installing in the chroot, please wait
es: Descargando e instalando en el chroot, por favor espera

source: I had problems to extract/install in the chroot, please do it manually: wget -qP /tmp https://github.com/ChrisADR/installer/releases/<desired_release>.tar.gz tar xf /tmp/<desired_release>.tar.gz -C /tmp cd /tmp/<extracted_dir> python setup.py install --prefix=/mnt/gentoo/usr python setup.py install_data --root=/mnt/gentoo
es: Tuve problemas para extraer/instalar en el chroot, por favor realizalo de manera manual: wget -qP /tmp https://github.com/ChrisADR/installer/releases/<release_deseado>.tar.gz tar xf /tmp/<release_deseado>.tar.gz -C /tmp cd /tmp/<directorio_extraído> python setup.py install --prefix=/mnt/gentoo/usr python setup.py install_data --root=/mnt/gentoo

source: I couldn't download installer, please download it manually: wget -qP /tmp https://github.com/ChrisADR/installer/releases/<desired_release>.tar.gz tar xf /tmp/<desired_release>.tar.gz -C /tmp cd /tmp/<extracted_dir> python setup.py install --prefix=/mnt/gentoo/usr python setup.py install_data --root=/mnt/gentoo
es: No pude descargar installer, hazlo de manera manual: wget -qP /tmp https://github.com/ChrisADR/installer/releases/<release_deseado>.tar.gz tar xf /tmp/<release_deseado>.tar.gz -C /tmp cd /tmp/<directorio_extraído> python setup.py install --prefix=/mnt/gentoo/usr python setup.py install_data --root=/mnt/gentoo

source: Your /dev/shm directory is a symbolic link, please run: rm /dev/shm && mkdif /dev/shm mount --types tmpfs --options nosuid,nodev,noexec shm /dev/shm Also ensure that mode 1777 is set: chmod 1777 /dev/shm
es: Tu directorio /dev/shm es un link simbólico, por favor ejecuta: rm /dev/shm && mkdif /dev/shm mount --types tmpfs --options nosuid,nodev,noexec shm /dev/shm También revisa que el modo esté configurado en: chmod 1777 /dev/shm

source: Please review your repos.conf directory, something is wrong If you need the text again, run 'installer beginner -s 5'
es: Por favor revisa tu directorio repos.conf, algo está mal Si deseas leer el texto otra vez, ejecuta 'installer beginner -s 5'

source: Please review your gentoo.conf file, something is wrong If you need the text again, run 'installer beginner -s 5'
es: Por favor revisa tu archivo gentoo.conf, algo está mal Si deseas leer el texto otra vez, ejecuta 'installer beginner -s 5'

source: Please review your resolv.conf file, something is wrong If you need the text again, run 'installer beginner -s 5'
es: Por favor revisa tu archivo resolv.conf, algo está mal Si deseas leer el texto otra vez, ejecuta 'installer beginner -s 5'

source: Step 6 - Entering the chroot ================================================================================ Congratulations!! Your are about to enter into your brand new Gentoo system. Please keep in mind that you need to have /mnt/gentoo mounted and /proc /sys /dev linked (step 5) and most likely if something goes wrong, you can resume from here (in most cases and if you don't need to change your partition table or filesystems and still have internet connection). The first command will be executed, after that you'll need to execute: chroot /mnt/gentoo /bin/bash #DO NOT USE THIS source /etc/profile #(this will set all the ENV variables) export PS1="(chroot) $PS1" #(this will help you to recognize the terminal) If you created some extra partitions like home or boot, mount them: mkdir /{boot,home} mount /dev/sdXy /{boot,home} Finally, run `installer beginner -s 7` to continue with the installation.
es: Paso 6 - Entrando en el chroot ================================================================================ ¡Felicidades! Estás a punto de entrar en tu nuevo sistema Gentoo. Por favor recuerda que si estás en este punto, debes revisar que todos los filesystems necesarios están vinculados (paso 5) y si por alguna razón algo va mal, puedes resumir desde aquí (en la mayoría de los casos no necesitas cambiar tu tabla de particiones o los filesystems, y deberías tener conexión a internet). El primer comando será ejecutado, luego tu necesitas ejecutar: chroot /mnt/gentoo /bin/bash #ESTE NO LO EJECUTES source /etc/profile #(configura tus variables de entorno) export PS1="(chroot) $PS1" #(ayudará a reconocer la terminal) Si creaste otras particiones extra como home o boot, montalas ahora: mkdir /{boot,home} mount /dev/sdXy /{boot,home} Finalmente, ejecuta `installer beginner -s 7` para continuar con la instalación.

source: Step 7 - Configuring Portage ================================================================================ First of all, welcome to your new Gentoo system! Before you can start enjoying Gentoo, you need to install your ebuild repository. Please run the following command: emerge-webrsync Note: Don't worry if Portage complains about missing /usr/portage/ location, the tool will create the location. Once sync is done, you'll see a warning about news items in the repository, it's a good idea to read the news before continue. Use: eselect news list eselect news read
es: Paso 7 - Configurando Portage ================================================================================ Antes que nada, ¡bienvenido a tu nuevo sistema Gentoo! Antes de disfrutar Gentoo, necesitas instalar tu repositorio de ebuilds. Por favor ejecuta los siguientes comandos: emerge-webrsync Nota: No te preocupes si Portage se queja sobre ubicaciones faltantes como /usr/portage/ , la herramienta generará las ubicaciones. Una vez la sincronización esté completada, verás una advertencia sobre noticias en el repositorio, es una buena idea leer las noticias antes de continuar. Usa: eselect news list eselect news read
