Repository: CarDGee/installer
Catalog: po/*/LC_MESSAGES/installer.po
Languages: es

source: Now you need to select a profile for building your system. you can use `eselect` for listing available profiles: eselect profile list To set the desired profile execute: eselect profile set <number> Please consider to read the profiles section in Gentoo Handbook for more detailed info: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Base#Choosing_the_right_profile Once your are done, you need to update your system to the new profile, execute: emerge --ask --update --deep --newuse @world This may be a long process, please be patient.
es: Ahora necesitas seleccionar un perfil para tu sistema, puedes usar `eselect` para listar los perfiles disponibles: eselect profile list Para elegir el perfil ejecuta: eselect profile set <número> Por favor considera leer la sección perfiles en el Gentoo Handbook para información más detallada: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Base#Choosing_the_right_profile Una vez completado, necesitas actualizar tu sistema al nuevo perfil, ejecuta: emerge --ask --update --deep --newuse @world Este puede ser un proceso largo, por favor se paciente.

source: USE flags help you to customize the building process, by default, each profile contains the recommended USE flags to be able to run the base system. If you need to add or remove some of them, it's highly suggested to read Handbook's section: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working Specially: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working#When_Portage_is_complaining https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working#Using_USE_flags If after reading these sections you still find problems, you can contact by IRC in #gentoo channel. Edit your /etc/portage/make.conf file in order to set the desired USE flags. Then save your changes and update your system with: emerge --ask --update --deep --newuse @world
es: Los flags USE ayudan a customizar el proceso de construcción. Por defecto, cada perfil contiene los USE flags recomendados para poder correr el sistema base. Si necesitas agregar o remover algunas de estas, es recomendable leer la siguiente sección del Handbook: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working Especialmente: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working#When_Portage_is_complaining https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working#Using_USE_flags Si tras leer estas secciones todavía tienes problemas, puedes solicitar ayuda por IRC en el canal #gentoo . Edita tu archivo /etc/portage/make.conf para poder modificar los USE flags. Luego guarda tus cambios y actualiza tu sistema con: emerge --ask --update --deep --newuse @world

source: Step 8 - Configuring the system ================================================================================ Now we need to configure some system-wide settings, first of all timezone. Run: ls /usr/share/zoneinfo Choose the right timezone and echo it in /etc/timezone, example: echo "America/Lima" > /etc/timezone Note: Please avoid /usr/share/zoneinfo/Etc/GMT* timezones, they may cause some strange behaviour. Once you are finish, please execute: emerge --config sys-libs/timezone-data This will reconfigure timezone-data package and update /etc/localtime
es: Paso 8 - Configurando el sistema ================================================================================ Necesitamos configurar opciones del sistema, primero los timezone. Ejecuta: ls /usr/share/zoneinfo Escoge la timezone adecuada y usa echo para dirigirla a /etc/timezone, ejemplo: echo "America/Lima" > /etc/timezone Nota: Por favor evita los timezones /usr/share/zoneinfo/Etc/GMT* , pueden causar comportamientos extraños. Una vez terminado, por favor ejecuta: emerge --config sys-libs/timezone-data Esto configurará tu paquete timezone-data y actualizará /etc/localtime

source: Now you need to set your locales, for that you'll have to edit /etc/locale.gen: nano -w /etc/locale.gen Warning: we strongly suggest to use at least one UTF-8 locale, as example: en_US.UTF-8 UTF-8 es_PE.UTF-8 UTF-8 en_US ISO-8859-1 de_DE ISO-8859-1 Once you have all the desired locales, generate them running: locale-gen Finally, set your desired locale (if you have more than one) with `eselect` and reload the environment: eselect locale list eselect locale set <number> env-update && source /etc/profile && export PS1="(chroot) $PS1"
es: Ahora configura tus locales, para eso tendrás que editar /etc/locale.gen: nano -w /etc/locale.gen Advertencia: recomendamos usar al menos un locale de tipo UTF-8, como ejemplo: en_US.UTF-8 UTF-8 es_PE.UTF-8 UTF-8 en_US ISO-8859-1 de_DE ISO-8859-1 Una vez que tengas todas las locales, genéralas ejecutando: locale-gen Finalmente, configura tus locales deseadas (si tienes más de una) con `eselect` y recarga el ambiente: eselect locale list eselect locale set <número> env-update && source /etc/profile && export PS1="(chroot) $PS1"

source: Step 9 - Configuring the kernel ================================================================================ Configuring the kernel is one of the most important tasks during installation, since you are in the beginner section, we highly recommend you to install genkernel-next. If you want or need to do it manually, please refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel First of all, download Gentoo's kernel and if you need special drivers (e.g. an extra driver for a wifi card) download linux-firmware too. emerge --ask sys-kernel/gentoo-sources sys-kernel/linux-firmware After that, emerge genkernel-next: emerge --ask sys-kernel/genkernel-next
es: Step 9 - Configurando el kernel ================================================================================ Configurar el kernel es una de las tareas más importantes durante la instalación dado que es la sección de principiantes, recomendamos que instale genkernel-next. Si desea o necesita hacerlo manualmente, por favor revise: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel Antes que nada, descargar el kernel de Gentoo y si necesita drivers especiales (p. e., un driver extra para una tarjeta de wifi) descargue linux-firmware. emerge --ask sys-kernel/gentoo-sources sys-kernel/linux-firmware Luego, descargue genkernel-next: emerge --ask sys-kernel/genkernel-next

source: Before to begin kernel configuration and installation, you need to edit your /etc/fstab file because genkernel will read it to place initramfs in /boot partition. This is a good time to leave your /etc/fstab file ready. nano -w /etc/fstab You have to write all your partitions as stated in /etc/fstab itself, once you are finish, save your changes and execute: genkernel --menuconfig all This will prompt a interactive menu where you have to enable your desired options, usually default is ok, but if you need some extra info, or you want to use systemd, these links may help you: https://wiki.gentoo.org/wiki/Systemd/Installing_Gnome3_from_scratch https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel#Activating_required_options https://wiki.gentoo.org/wiki/Wifi#Kernel
es: Antes de comenzar la configuración del kernel y la instalación, necesita editar su archivo /etc/fstab porque genkernel lo leerá para poder poner el initramfs en la partición /boot. Este es un buen momento para dejar /etc/fstab listo. nano -w /etc/fstab Tiene que escribir sus particiones como muestra el mismo /etc/fstab, una vez finalizado, guarde sus cambios y ejecute: genkernel --menuconfig all Esto lanzará un menú interactivo donde tiene que habilitar las opciones deseadas, usualmente los default están bien, pero si necesita información extra, o quiere usar systemd, estos links pueden ser de ayuda: https://wiki.gentoo.org/wiki/Systemd/Installing_Gnome3_from_scratch https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel#Activating_required_options https://wiki.gentoo.org/wiki/Wifi#Kernel

source: Step 10 - Configuring the system ================================================================================ We are almost there, now you need to set the root password, execute: passwd After that you may want to set your host name, you'll need to refer to your init system's documentation, some examples include: nano -w /etc/conf.d/hostname (OpenRC) hostnamectl COMMAND (SystemD) This is a good moment to download all the required or desired software that does not come with the base stage3 tarball, specially networking related software: emerge --ask net-misc/networkmanager emerge --ask net-misc/dhcpcd emerge --ask net-wireless/iw net-wireless/wpa_supplicant If you need more detailed info, refer to: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Networking
es: Paso 10 - Configurando el sistema ================================================================================ Ya casi hemos acabado, ahora necesita configurar la clave de root, ejecute: passwd Después, tal vez quiera configurar el hostname, necesitará referirse a la documentación de su sistema init, algunos ejemplos incluyen: nano -w /etc/conf.d/hostname (OpenRC) hostnamectl COMMAND (SystemD) Este es un buen momento para descargar todo el software deseado que no viene por defecto en un comprimido stage3, como los relacionados a redes: emerge --ask net-misc/networkmanager emerge --ask net-misc/dhcpcd emerge --ask net-wireless/iw net-wireless/wpa_supplicant Si necesita información más detallada, revise: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Networking

source: If you are not using systemd as your init system, you need to install a logger: (You only need ONE from these) emerge --ask app-admin/sysklogd (recommended for beginners) emerge --ask app-admin/syslog-ng emerge --ask app-admin/metalog You may want to read the next section for other optional tools: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Tools
es: Si no está usando systemd como sistema init, necesita instalar un logger: (Solo necesita UNO de estos) emerge --ask app-admin/sysklogd (recomendado para principiantes) emerge --ask app-admin/syslog-ng emerge --ask app-admin/metalog Tal vez quiera leer la siguiente sección sobre herramientas: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Tools

source: Step 11 - Configuring the bootloader ================================================================================ Last step in the list! You are about to finish the Gentoo installation process!! Now we need a bootloader, we'll recommend grub, but feel free to install other if you want to. Note: UEFI users, please make sure that you have GRUB_PLATFORMS="efi-64" in your /etc/portage/make.conf file before emerging grub, not doing so may cause unexpected results. echo 'GRUB_PLATFORMS="efi-64"' >> /etc/portage/make.conf emerge --ask sys-boot/grub Then install the bootloader with: grub-install /dev/sda WARNING: UEFI users are highly encouraged to read following section before installing grub: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Bootloader#Install
es: Paso 11 - Configurando el bootloader ================================================================================ ¡Último paso!¡Estás por finalizar el proceso de instalación de Gentoo! Ahora necesitamos un bootloader, recomendamos grub, pero siéntase libre de instalar otro si así lo desea. Nota: usuarios UEFI, por favor asegúrense que tienen configurado GRUB_PLATFORMS="efi-64" en su archivo /etc/portage/make.conf antes de instalar grub, no hacerlo puede causar resultados inesperados. echo 'GRUB_PLATFORMS="efi-64"' >> /etc/portage/make.conf emerge --ask sys-boot/grub Luego instale el bootloader con: grub-install /dev/sda ADVERTENCIA: usuarios UEFI, les recomendamos leer la siguiente sección ANTES de instalar grub: https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Bootloader#Install

source: Now you need to configure grub, this way it'll be able to find your partitions and initramfs. Execute: grub-mkconfig -o /boot/grub/grub.cfg If you have no error messages, CONGRATULATIONS! you have now a fully installed Gentoo system. But before finishing this tutorial, you need to check a couple things: -Start/enable all the needed services: e.g. if you installed NetworkManager: systemctl enable NetworkManager (SystemD) rc-update add NetworkManager default (OpenRC) -Install your Window Manager or Desktop Environment: e.g. GNOME or Plasma emerge --ask [gnome|plasma|i3] -Create a new user: useradd -m -G users,wheel,audio -s /bin/bash larry passwd larry
es: Ahora necesitas configurar grub, de este modo podrá encontrar las particiones y el initramfs. Ejecute: grub-mkconfig -o /boot/grub/grub.cfg Si no aparecen mensajes de error, ¡FELICIDADES! ahora tienes un sistema Gentoo totalmente instalado. Pero antes de finalizar este tutorial, necesitas revisar un par de cosas: -Inicia los servicioes necesarios: por ejemplo, si instalaste NetworkManager: systemctl enable NetworkManager (SystemD) rc-update add NetworkManager default (OpenRC) -Instala tu Window Manager o Desktop Environment: por ejemplo, GNOME o Plasma emerge --ask [gnome|plasma|i3] -Crea un nuevo usuario: useradd -m -G users,wheel,audio -s /bin/bash larry passwd larry

source: To clean installer from your new Gentoo system; exit the chroot with 'exit', then execute: installer cleanup Finally, you need to umount all the linked directories: umount -l /mnt/gentoo/dev{/shm,/pts,} umount -R /mnt/gentoo We recommend you to read these sections to work with Gentoo and Portage: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Portage If you are reading this message this could mean that now you have your own Gentoo system, thank your for trying installer and if you find any bug or error, even if you have enhancement ideas, feel free to email me: chrisadr@gentoo.org Thank you :) and enjoy Gentoo!
es: Para limpiar installer del nuevo sistema Gentoo; salga del chroot con 'exit', luego ejecute: installer cleanup Finalmente, necesita desmontar los directorios vinculados: umount -l /mnt/gentoo/dev{/shm,/pts,} umount -R /mnt/gentoo Recomendamos las siguientes secciones para trabajar con Gentoo y Portage: https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Working https://wiki.gentoo.org/wiki/Handbook:AMD64/Full/Portage Si estás leyendo este mensaje podría significar que ahora tienes tu propio sistema Gentoo, gracias por probar installer y si encontraste algún bug o error, incluso si tienes ideas para mejorarlo, siéntete libre de mandarme un mail: chrisadr@gentoo.org Gracias :) y ¡disfruta Gentoo!
